---
kind: property
id: P:Autodesk.Revit.DB.RepeaterBounds.DimensionCount
source: html/b8017ee1-1af3-bfb3-a6cc-da8e228674a4.htm
---
# Autodesk.Revit.DB.RepeaterBounds.DimensionCount Property

The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.)

## Syntax (C#)
```csharp
public int DimensionCount { get; }
```